# DBeam_SetLampRot

```pascal
PROCEDURE DBeam_SetLampRot(rot : REAL);
```

```python
def vs.DBeam_SetLampRot(rot):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|rot|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight